{
  "Reconnaissance": "Between 18 and 25 July 2011, the attackers conducted reconnaissance activities on SK Communications. They used infected computers to collect additional internal access information and database credentials. The attackers likely used a file named 'x.exe' to acquire some of this information, conducting network enumeration and obtaining credentials such as usernames and passwords.",
  "Resource Development": "None",
  "Initial Access": "The attackers gained initial access by compromising a server belonging to a South Korean software company used to deliver software updates to customers, including SK Communications. They modified the server so that SK Communications computers would receive a trojaned update file during routine checks for software updates. This trojaned update exploited a software vulnerability in the ALTools Common Module, allowing a malicious DLL file to be loaded instead of the legitimate DLL update file, thereby enabling malicious code to be run and malware to be installed on computers requesting the update.",
  "Execution": "Once the trojaned update was downloaded onto the SK Communications computers, they became infected with malware known as 'Backdoor.Agent.Hza'. The trojaned update file 'dropped' the malware onto the computers, giving the attacker a 'backdoor' into them. The malware was detected as 'Trojan.Dropper.Agent.Hza', 'Backdoor.Agent.Hza', 'V.DRP.Agent.Hza', and 'V.BKD.Agent.Hza' by different versions of ESTsoft's ALYac antivirus software.",
  "Persistence": "None",
  "Privilege Escalation": "None",
  "Defense Evasion": "The attackers used 'waypoints' to obfuscate the source of their activities, successfully stealing personal details from SK Communications customers. The malware employed basic obfuscation techniques, with all strings obfuscated in memory and only decoded when needed, making static analysis more difficult. Unnecessary operations were inserted at frequent intervals throughout the code, likely to make reverse engineering more difficult and potentially indicating that the malware is polymorphic.",
  "Credential Access": "Between 18 July 2011 and 25 July 2011, the attackers used the infected computers to collect additional internal access information and database credentials. They presumably used a file named 'x.exe' to acquire some of this information, after downloading it onto infected computers from a toolbox they had earlier set up. The attackers likely used it to conduct network enumeration and to obtain credentials such as usernames and passwords.",
  "Discovery": "None",
  "Lateral Movement": "None",
  "Collection": "The attackers used the malware 'nateon.exe' and the callback domains 'nateon.duamlive.com' and 'ro.diggfunny.com' to access SK Communications' Nate and CyWorld user databases, stealing the personal details of up to 35 million users. These personal details included names, phone numbers, home and email addresses, birth dates, gender details, user identifiers, passwords, and resident registration numbers. The passwords and resident registration numbers were reportedly encrypted, but the other details were not.",
  "Command and Control": "Once infected, the computers communicated with the command and control server located at South Korean IP address 116.127.121.41 on TCP port 8080. It is possible the infected SK computers used the callback domain 'update.alyac.org' to locate the command and control server. The malware attempted communications to a command and control server located using a callback domain. It also created a raw socket and bound it to the infected computer’s local IP address, acting as a packet sniffer, allowing the RAT to passively receive commands on any port using any protocol.",
  "Exfiltration": "The personal information extracted from the databases was purportedly sent via a waypoint to a Chinese IP address where the hacker received the information. The waypoint used purportedly belonged to a company based in Seoul’s Nonhyeon neighborhood.",
  "Impact": "None",
  "Others": "The attack on SK Communications was sophisticated and likely conducted by an Advanced Persistent Threat. The attackers used a legitimate company to host tools used in the intrusion, specifically a Taiwanese publishing company's webserver, which was compromised unbeknownst to its owner and used by the attacker as a toolbox from which to download malicious files and hacker tools onto targeted computers. The attackers also used legitimate-looking domains to disguise their activities, such as 'alyac.org' and 'nateon.duamlive.com', which were not associated with the legitimate companies they appeared to represent."
}